Tekla Open API Reference for Tekla Structures 2025
LocExtension Constructor
 Localization extension for strings referred in xaml
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LocExtension(
	string name
)
Public Sub New (
	name As String
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Tekla.Structures.Dialog.LocExtension.#ctor(System.String)"]
See Also
Reference
LocExtension Class
Tekla.Structures.Dialog Namespace